Revit 2026 API

# BracePlanRepresentation Enumeration

---

The possible representations for braces in plan views.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BracePlanRepresentation
```
```vb
Public Enumeration BracePlanRepresentation
```
```cpp
public enum class BracePlanRepresentation
```
```fsharp
type BracePlanRepresentation
```

| Member name | Value | Description |
| --- | --- | --- |
| LineWithAngle | 2 | Braces are represented by a line with angle. |
| ParallelLine | 1 | Braces are represented by a parallel line. |

#### Reference

Autodesk.Revit.DB.Structure Namespace